/**
 * 确保 a == 1 && a == 2 && a == 3 输出为true
 * 设计a
 */
// const a = {
// 	val: 1,
// 	valueOf() {
// 		return this.val++;
// 	},
// };
// console.log(a == 1 && a == 2 && a == 3, '----------------');
/**
 * 二进制运算符
 *  & 按位与
 *  | 按位或
 *  ^ 按位异或
 *  ~ 按位取反
 *  << 左移
 *  >> 右移
 */
//  & | ^ 二进制运算符
const a = 5 // 00000000000000000000000000000101
const b = 3 // 00000000000000000000000000000011

console.log(a ^ b, a | b, a & b, a << 1, a >> 1) // 00000000000000000000000000000001
